

### LLM의 파이프라인

##01. 사전학습
인터넷에서 방대한 데이터를 수집 및 처리 
-> 텍스트를 토큰 시퀀스로 변환
-> 신경망에 입력하여 다음에 올 토큰을 예측 (처음에는 무작위 파라미터)
-> 출력된 확률분포와 실제 훈련 데이터(다음 토큰)의 오차를 줄이도록 파라미터(가중치) 조정 
-> 결과: 베이스 모델
   - 질문에 답하는 것이 아니라 통계적으로 가장 자연스럽게 이어질 다음 텍스트를 생성하는 '인터넷 문서 완성기'이다.

##02. 후속학습(파인튜닝) : 
1. **지도 미세조정**
인간 라벨러가 질문-답변(대화) 데이터셋 작성
-> 이 고품질 대화의 통계적 패턴을 학습하여 어시스턴트의 페르소나(형식과 말투)를 갖춤

2. **인간 피드백 기반 강화학습**
모델이 생성한 여러 응답에 대해 인간이 선호도(안전성, 유용성 등) 점수를 매김
-> 보상 모델을 구축하고 가장 높은 점수를 받도록 강화학습 수행
-> 결과: 인스트럭트 튜닝 모델(Instruct-tuned Model)
인간의 가치관과 지침에 정렬되어, 위험한 대답을 피하고 도움이 되는 대답을 하도록 최적화됨.




### 용어

- 토큰(Token): 
컴퓨터가 텍스트를 수학적으로 계산하기 좋게 잘라 놓은 단위로,
고유한 정수 ID로 변환되며 벡터로 맵핑된다.
처음 보는 단어도 처리할 수 있도록 텍스트를 띄어쓰기 기준이 아니라 자주 쓰이는 글자 패턴(어근, 접두사 등)
단위로 쪼개어 효율성을 높인다.

- 임베딩:
무의미한 정수 ID에 의미를 부여하는 과정이다.
즉, 이산적 토큰 ID를 다차원 연속 공간의 밀집 벡터로 매핑하여,
단어 간의 의미적 유사성을 수학적으로 계산할 수 있게 하는 데이터 변환 과정이다.

- 어텐션:
임베딩을 통해 단어들이 각자의 뜻을 가졌다면
이제 문장 속에서 단어들끼리 어떻게 어울리는지 파악해야 한다.
어텐션은 입력 시퀀스의 각 토큰이 문장 내 다른 모든 토큰들과의 어떤 연관성(가중치)을 갖는지 계산하여
문맥적 의미를 반영하는 메커니즘이다.




- 컨텍스트 윈도우: 
모델이 한번에 처리하고 기억할 수 있는, 입력 및 출력 토큰의 최대 허용 길이
- 확률 분포 출력: 어휘의 모든 토큰에 대해 다음에 올 확률을 예측
- 레이블(정답): 훈련 데이터에서 실제로 다음에 오는 토큰
- 파라미터 업데이트: 정답 토큰의 확률을 높이도록 신경망을 수학적으로 조정하는 행위
- 추론: 훈련된 모델로 새로운 데이터를 생성하는 과정
- 샘플링: 확률 분포를 바탕으로, 확률적 알고리즘에 따라 다음 토큰을 선택하는 과정
- 파인튜닝(Fine-tuning): 베이스 모델을 특정 용도(예: 어시스턴트)에 맞게 추가 학습

